### 1. Write a Pandas program to create and display a one-dimensional array-like object containing an array of data.

In [1]:
import pandas as pd
df=pd.Series([2,4,6,8,10])
df

0     2
1     4
2     6
3     8
4    10
dtype: int64

### 2. Write a Pandas program to convert a Panda module Series to Python list and itâ€™s type.

In [2]:
df=pd.Series([2,4,6,8,10])
print(type(df))

list_df=list(df)    # or df.tolist()
print(type(list_df))

<class 'pandas.core.series.Series'>
<class 'list'>

### 3. Write a Pandas program to add, subtract, multiple and divide two Pandas Series

In [3]:
df=pd.Series([1,2,3])
df1=pd.Series([1,4,10])
print(df+df1)
print()
print(df1/df)

0     2
1     6
2    13
dtype: int64

0    1.000000
1    2.000000
2    3.333333
dtype: float64

### 4. Write a Pandas program to convert a dictionary to a Pandas series.

In [4]:
dict={'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
Series1=pd.Series(dict)
type(Series1)

pandas.core.series.Series

### 5. Write a Pandas program to convert a NumPy array to a Pandas series

In [5]:
import numpy as np
a=np.array([1,2,3])
b=pd.Series(a)
type(b)

pandas.core.series.Series

### 6. Write a Pandas program to change the data type of given a column or a Series

In [6]:
df=pd.Series(['100', '200', 'python', '300.12', '400'])
pd.to_numeric(df , errors='coerce')

# https://pandas.pydata.org/docs/reference/api/pandas.to_numeric.html

0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

### 7. Write a Pandas program to convert the first column of a DataFrame as a Series.

In [7]:
person={
    'first':['Vaibhav' , 'Sam'],
    'last':['Nath' , 'Roh']
}
df=pd.DataFrame(person)   #create a dataframe.
print(df)
print()
a=df['first']     #convert a column to Series
print(a)
type(a)      #returns type of Series

     first  last
0  Vaibhav  Nath
1      Sam   Roh

0    Vaibhav
1        Sam
Name: first, dtype: object

pandas.core.series.Series

### 8. Write a Pandas program to convert a given Series to an array

In [8]:
df=pd.Series(['100', '200', 'python', '300.12', '400'])
print(df)
print()
a=np.array(df)
print(a)

0       100
1       200
2    python
3    300.12
4       400
dtype: object

['100' '200' 'python' '300.12' '400']

### 9. Write a Pandas program to convert Series of lists to one Series.

In [9]:
s = pd.Series([
    ['Red', 'Green', 'White'],
    ['Red', 'Black'],
    ['Yellow']])
s.apply(pd.Series).stack().reset_index(drop=True)

0       Red
1     Green
2     White
3       Red
4     Black
5    Yellow
dtype: object

### 10. Write a Pandas program to sort a given Series.

In [10]:
a=pd.Series(['4','5','1','3','0','-1','python'])
pd.Series.sort_values(a)

5        -1
4         0
2         1
3         3
0         4
1         5
6    python
dtype: object

### 11. Write a Pandas program to add some data to an existing Series.

In [11]:
a=pd.Series(['4','5','1','3','0','-1','python'])
a.append(pd.Series(['7','8']))

0         4
1         5
2         1
3         3
4         0
5        -1
6    python
0         7
1         8
dtype: object

### 12. Write a Pandas program to create a subset of a given series based on value and condition.

In [12]:
a=pd.Series([0,1,2,3,4,5,6,7,8,9])
n=5
b=a[a<n]
b

0    0
1    1
2    2
3    3
4    4
dtype: int64

### 13. Write a Pandas program to change the order of index of a given series.

In [13]:
a=pd.Series([7,1,2,3,4] , index=['b','a','c','e','d'])
print(a)
a=a.reindex(index=['a','b','c','d','e'])
a

b    7
a    1
c    2
e    3
d    4
dtype: int64

a    1
b    7
c    2
d    4
e    3
dtype: int64

### 14. Write a Pandas program to create the mean and standard deviation of the data of a given Series.

In [14]:
a=pd.Series([7,1,2,3,4])
print(a.mean())
print(a.median())
print(a.std())

3.4
3.0
2.3021728866442674

### 15. Write a Pandas program to get the items of a given series not present in another given series.

In [15]:
a=pd.Series([1,2,3,4,5])
b=pd.Series([2,4,6,8,10])
r=a[~a.isin(b)]
r

0    1
2    3
4    5
dtype: int64

### 16. Write a Pandas program to get the items which are not common of two given series.

In [16]:
import numpy as np
a=pd.Series([1,2,3,4,5])
b=pd.Series([2,4,6,8,10])
a1=pd.Series(np.union1d(a,b))
print(a1)
print()
b1=pd.Series(np.intersect1d(a,b))
print(b1)
r=a1[~a1.isin(b1)]
r

0     1
1     2
2     3
3     4
4     5
5     6
6     8
7    10
dtype: int64

0    2
1    4
dtype: int64

0     1
2     3
4     5
5     6
6     8
7    10
dtype: int64

### 17. Write a Pandas program to compute the minimum, 25th percentile, median, 75th, and maximum of a given series.

In [17]:
a=np.random.RandomState(100)
b=pd.Series(a.normal(10,1,20))   # 10-->mean , 1-->std (both approximate for Series.) , 20-->no. of terms
print(b)
print()
r=np.percentile(b , q=[0,25,50,75,100])
print(r)

0      8.250235
1     10.342680
2     11.153036
3      9.747564
4     10.981321
5     10.514219
6     10.221180
7      8.929957
8      9.810504
9     10.255001
10     9.541973
11    10.435163
12     9.416405
13    10.816847
14    10.672721
15     9.895589
16     9.468720
17    11.029733
18     9.561864
19     8.881682
dtype: float64

[ 8.25023453  9.52365967 10.05838426 10.55384433 11.1530358 ]

### 18. Write a Pandas program to calculate the frequency counts of each unique value of a given series.

In [18]:
import numpy as np
n=pd.Series(np.random.randint(1,5,8))
print(n)
b=n.value_counts()
print(b)

0    2
1    4
2    4
3    3
4    2
5    3
6    1
7    2
dtype: int32
2    3
3    2
4    2
1    1
dtype: int64

### 19. Write a Pandas program to display most frequent value in a given series and replace everything else as 'Other' in the series.

In [19]:
import numpy as np
n=pd.Series(np.random.randint(1,5,8))
print(n)
b=n.value_counts()
print(b)
result = n[~n.isin(n.value_counts().index[:1])] = 'Other'
print(n)

0    2
1    4
2    3
3    1
4    3
5    2
6    1
7    2
dtype: int32
2    3
1    2
3    2
4    1
dtype: int64
0        2
1    Other
2    Other
3    Other
4    Other
5        2
6    Other
7        2
dtype: object

### 20. Write a Pandas program to find the positions of numbers that are multiples of 5 of a given series.

In [20]:
a=pd.Series(np.random.randint(1,10,10))
print(a)
r=np.argwhere([a % 5 == 0])
print(r)    # 0 is output is the row number of Series.

0    8
1    1
2    7
3    2
4    2
5    9
6    4
7    1
8    8
9    1
dtype: int32
[]

### 21. Write a Pandas program to extract items at given positions of a given series.

In [21]:
a=pd.Series(np.random.randint(1,5,10))
print(a)
print()
e=[0,2,3,6,8]
a.take(e)

0    4
1    4
2    3
3    3
4    2
5    1
6    4
7    2
8    1
9    3
dtype: int32

0    4
2    3
3    3
6    4
8    1
dtype: int32

### 22. Write a Pandas program to get the positions of items of a given series in another given series.

In [22]:
a=pd.Series([0,4,1,2,44,3,8])
b=[4,2,8]
r=[pd.Index(a).get_loc(i) for i in b]
print(r)

[1, 3, 6]

### 23. Write a Pandas program to calculate the number of characters in each word in a given series.

In [23]:
a = pd.Series(['Php', 'Python', 'Java', 'C#'])
print(a)
result = a.map(lambda x: len(x))
print(result)

0       Php
1    Python
2      Java
3        C#
dtype: object
0    3
1    6
2    4
3    2
dtype: int64

### 24. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

In [24]:
import numpy as np
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}

labels = ['a' , 'b' , 'c' , 'd' , 'e' , 'f' , 'g' , 'h' , 'i' , 'j']
df=pd.DataFrame(exam_data , index = labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

### 25. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

### 26. Write a Pandas program to get the first 3 rows of a given DataFrame

In [26]:
df.iloc[:3]    #or df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

### 27. Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

In [27]:
df[['name' , 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

### 28. Write a Pandas program to select the specified columns and rows from a given DataFrame.

In [28]:
df.iloc[[1,3,5,7] , [1,3]]

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
h    NaN      no

### 29.  Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

In [29]:
df[df['attempts']>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

### 30. Write a Pandas program to count the number of rows and columns of a DataFrame.

In [30]:
df.shape

(10, 4)

### 31. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

In [31]:
df[df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

### 32. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).

In [32]:
df[df['score'].between(15,20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

### 33. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

In [33]:
df[(df['attempts'] < 2) & (df['score'] > 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

### 33. Write a Pandas program to change the score in row 'd' to 11.5.

In [34]:
df.loc['d' , 'score']=11.5
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

### 34. Set and reset index of DataFrame

In [35]:
'''df.set_index('attempts' , inplace=True)
df'''

"df.set_index('attempts' , inplace=True)\ndf"

In [36]:
'''df.reset_index(inplace=True)
df'''

'df.reset_index(inplace=True)\ndf'

### 35. Write a Pandas program to calculate the sum of the examination attempts by the students.

In [37]:
df['attempts'].sum()

19

### 36. Write a Pandas program to calculate the mean score for each different student in DataFrame.

In [38]:
df['score'].mean()

13.333333333333334

### 37. Write a Pandas program to append a new row 'k' to DataFrame with given values for each column. Now delete the new row and return the original data frame.

In [39]:
df.loc['k']=['Ram' ,'10' ,'2' , 'yes' ]  #add new row
df

        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima   9.0        3      no
c  Katherine  16.5        2     yes
d      James  11.5        3      no
e      Emily   9.0        2      no
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
j      Jonas  19.0        1     yes
k        Ram    10        2     yes

In [40]:
df.loc['a']=['Ram' ,'10' ,'2' , 'yes' ]
df

        name score attempts qualify
a        Ram    10        2     yes
b       Dima   9.0        3      no
c  Katherine  16.5        2     yes
d      James  11.5        3      no
e      Emily   9.0        2      no
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
j      Jonas  19.0        1     yes
k        Ram    10        2     yes

In [41]:
df.loc['a']=['Anastasia' ,'12.5' ,'1' ,'yes']
df

        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima   9.0        3      no
c  Katherine  16.5        2     yes
d      James  11.5        3      no
e      Emily   9.0        2      no
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
j      Jonas  19.0        1     yes
k        Ram    10        2     yes

In [42]:
df=df.drop('k')   #delete the newly added row
df

        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima   9.0        3      no
c  Katherine  16.5        2     yes
d      James  11.5        3      no
e      Emily   9.0        2      no
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
j      Jonas  19.0        1     yes

### 38. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.

In [43]:
a=df.sort_values(by=['name' , 'score'], ascending=[False , True])
a

        name score attempts qualify
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
c  Katherine  16.5        2     yes
j      Jonas  19.0        1     yes
d      James  11.5        3      no
e      Emily   9.0        2      no
b       Dima   9.0        3      no
a  Anastasia  12.5        1     yes

### 39. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False

In [44]:
df = pd.DataFrame(exam_data , index=labels)
print(df)
print()
df['qualify'] = df['qualify'].map({'yes': True, 'no': False})
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

### 40. Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame.

In [45]:
df['name']=df['name'].replace('James','Suresh')
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d     Suresh    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

### 41. Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [46]:
df.drop(columns={     #drop column temporary
    'attempts'
})

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d     Suresh    NaN    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True

In [47]:
# df.pop('name')   ##drop column permanently

In [49]:
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d     Suresh    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

### 42. Write a Pandas program to insert a new column in existing DataFrame.

In [54]:
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
df['color']=color
df

        name  score  attempts  qualify   color
a  Anastasia   12.5         1     True     Red
b       Dima    9.0         3    False    Blue
c  Katherine   16.5         2     True  Orange
d     Suresh    NaN         3    False     Red
e      Emily    9.0         2    False   White
f    Michael   20.0         3     True   White
g    Matthew   14.5         1     True    Blue
h      Laura    NaN         1    False   Green
i      Kevin    8.0         2    False   Green
j      Jonas   19.0         1     True     Red

### 43. Write a Pandas program to iterate over rows in a DataFrame.

In [58]:
for index, row in df.iterrows():
    print(row['name'],row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5
Suresh nan
Emily 9.0
Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Jonas 19.0

### 44. Write a Pandas program to rename columns of a given DataFrame

In [69]:
df=df.rename(columns={
    'color':'colour',
    'attempts':'attempt'
}
)
df

        name  score  attempt  qualify  colour
a  Anastasia   12.5        1     True     Red
b       Dima    9.0        3    False    Blue
c  Katherine   16.5        2     True  Orange
d     Suresh    NaN        3    False     Red
e      Emily    9.0        2    False   White
f    Michael   20.0        3     True   White
g    Matthew   14.5        1     True    Blue
h      Laura    NaN        1    False   Green
i      Kevin    8.0        2    False   Green
j      Jonas   19.0        1     True     Red

### 45. Write a Pandas program to select rows from a given DataFrame based on values in some columns.

In [73]:
d = {
    'col1': [1, 4, 3, 4, 5],
    'col2': [4, 5, 6, 7, 8], 
    'col3': [7, 8, 9, 0, 1]
}
df=pd.DataFrame(d)
df.loc[df['col1']==4]

   col1  col2  col3
1     4     5     8
3     4     7     0

### 46. Write a Pandas program to change the order of a DataFrame columns.

In [76]:
df=df[['col3','col2','col1']]
df

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5

### 47. Write a Pandas program to add one row in an existing DataFrame.

In [85]:
df.loc['5']=['1','2','3']
df

  col3 col2 col1
0    7    4    1
1    8    5    4
2    9    6    3
3    0    7    4
4    1    8    5
5    1    2    3

### 48. Write a Pandas program to write a DataFrame to CSV file using tab separator.

In [89]:
df.to_csv('new.csv' , sep=',' , index = False)
a=pd.read_csv('new.csv')
print(a)

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5
5     1     2     3

### 49. Write a Pandas program to count city wise number of people from a given data set (city, name of the person).

In [103]:
df1 = pd.DataFrame(
    {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 
             'Georgia', 'Georgia', 'Los Angeles']
    }
)
print(df1)
print()
for index , row in df1.iterrows():
    print(row['city'] + ' : ' + row['name'])

print()
g1=df1.groupby(['city']).size().reset_index(name='Number of people')
print(g1)

        name         city
0  Anastasia   California
1       Dima  Los Angeles
2  Katherine   California
3      James   California
4      Emily   California
5    Michael  Los Angeles
6    Matthew  Los Angeles
7      Laura      Georgia
8      Kevin      Georgia
9      Jonas  Los Angeles

California : Anastasia
Los Angeles : Dima
California : Katherine
California : James
California : Emily
Los Angeles : Michael
Los Angeles : Matthew
Georgia : Laura
Georgia : Kevin
Los Angeles : Jonas

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

### 50. Write a Pandas program to delete DataFrame row(s) based on given column value.

In [129]:
df=df[df.col2!=5]
df

  col3 col2 col1
0    7    4    1
2    9    6    3
3    0    7    4
4    1    8    5
5    1    2    3

### 51. Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.

In [144]:
d = {
    'col1': [1, 4, 3, 4, 5],
    'col2': [4, 5, np.nan, 7, np.nan], 
    'col3': [7, 8, 9, 0, 1]
}
df=pd.DataFrame(d)
print(df)
df.iloc[2:4]

   col1  col2  col3
0     1   4.0     7
1     4   5.0     8
2     3   NaN     9
3     4   7.0     0
4     5   NaN     1

   col1  col2  col3
2     3   NaN     9
3     4   7.0     0

In [148]:
df.fillna(0)

   col1  col2  col3
0     1   4.0     7
1     4   5.0     8
2     3   0.0     9
3     4   7.0     0
4     5   0.0     1

### 52. Write a Pandas program to convert index in a column of the given dataframe.

In [150]:
df

   col1  col2  col3
0     1   4.0     7
1     4   5.0     8
2     3   NaN     9
3     4   7.0     0
4     5   NaN     1

In [152]:
df.set_index('col1')

      col2  col3
col1
1      4.0     7
4      5.0     8
3      NaN     9
4      7.0     0
5      NaN     1

In [153]:
df.reset_index()

   index  col1  col2  col3
0      0     1   4.0     7
1      1     4   5.0     8
2      2     3   NaN     9
3      3     4   7.0     0
4      4     5   NaN     1

### 53. Write a Pandas program to set a given value for particular cell in DataFrame using index value.

In [186]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

df=pd.DataFrame(exam_data)
print(df)
df.at[7 , 'score']=10
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura   10.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

### 54. Write a Pandas program to drop a list of rows from a specified DataFrame.

In [188]:
df=df.drop(df.index[[2,3]])
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura   10.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes